Revit 2020 API
Checker Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Checker
Visual Basic
Public NotInheritable Class Checker
Visual C++
public ref class Checker abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Checker
See Also
Checker Members
Autodesk.Revit.DB.Visual Namespace